//=============================================================================
//
// チュートリアルロゴの処理 [tutoriallogo.cpp]
// Author : 竹内亘
//
//=============================================================================
#include "tutoriallogo.h"
#include "renderer.h"
#include "fade.h"
#include "input.h"
#include "resource.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define BUTTON_COLOR		(D3DXCOLOR(1.0f, 1.0f, 0.0f, 1.0f))
#define BLINK_COUNT			(60)
#define BLINK_COUNT_FAST	(2)

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================

//=============================================================================
// チュートリアルロゴの生成処理
//=============================================================================
CTutorialLogo *CTutorialLogo::Create(D3DXVECTOR3 pos, float fWidth, float fHeight, int nType)
{
	CTutorialLogo *pTutorialLogo = NULL;

	if (pTutorialLogo == NULL)
	{
		// チュートリアルロゴクラスの生成
		pTutorialLogo = new CTutorialLogo;

		if (pTutorialLogo != NULL)
		{
			pTutorialLogo->SetPosition(pos);
			pTutorialLogo->SetWidth(fWidth);
			pTutorialLogo->SetHeight(fHeight);
			pTutorialLogo->Init();
			pTutorialLogo->BindTexture(CResource::GetTexture(nType));
		}
	}

	return pTutorialLogo;
}

//=============================================================================
// チュートリアルロゴクラスのコンストラクタ
//=============================================================================
CTutorialLogo::CTutorialLogo()
{
}

//=============================================================================
// チュートリアルロゴクラスのデストラクタ
//=============================================================================
CTutorialLogo::~CTutorialLogo()
{
}

//=============================================================================
// チュートリアルロゴ初期化処理
//=============================================================================
HRESULT CTutorialLogo::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();

	CLogo::SetCol(BUTTON_COLOR);

	return S_OK;
}

//=============================================================================
// チュートリアルロゴ終了処理
//=============================================================================
void CTutorialLogo::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// チュートリアルロゴ更新処理
//=============================================================================
void CTutorialLogo::Update(void)
{
	//// 入力情報を取得
	//CInputKeyboard *pInputKeyboard;
	//pInputKeyboard = CManager::GetInputKeyboard();

	//// 入力情報を取得
	//CInputJoypad *pInputJoypad;
	//pInputJoypad = CManager::GetInputJoypad();

	//// フェードの状態を取得
	//CFade::FADE fade;
	//fade = CFade::GetFade();
}

//=============================================================================
// チュートリアルロゴ描画処理
//=============================================================================
void CTutorialLogo::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}