//=============================================================================
//
// テキスト読み込み処理 [text.h]
// Author : 長山拓実
//
//=============================================================================
#ifndef _TEXT_H_
#define _TEXT_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//========================================
// クラスの定義
//========================================
//=====================
// テキストクラス
//=====================
class CText
{
public:
	CText();									// コンストラクタ
	~CText();									// デストラクタ

	void Init(void);						// 初期化
	void Uninit(void);						// 終了
	char *ReadLine(FILE *pFile, char *pDst);	// 無効な行を無視する
	char *GetLineTop(char *pSrc);				// 文字列の先頭を見つける
	int  PopString(char *pSrc, char *pDest);	// 文字列を抜き出す
};

#endif