//=============================================================================
//
// ランキングロゴ2の処理 [rankinglogo2.cpp]
// Author : 竹内亘
//
//=============================================================================
#include "rankinglogo2.h"
#include "renderer.h"
#include "fade.h"
#include "input.h"
#include "resource.h"

//=============================================================================
// マクロ定義
//=============================================================================
#define BUTTON_COLOR		(D3DXCOLOR(1.0f, 1.0f, 0.0f, 1.0f))
#define BLINK_COUNT			(60)
#define BLINK_COUNT_FAST	(2)

//=============================================================================
// 静的メンバ変数宣言
//=============================================================================

//=============================================================================
// タイトルロゴの生成処理
//=============================================================================
CRankingLogo2 *CRankingLogo2::Create(D3DXVECTOR3 pos, float fWidth, float fHeight, int nType)
{
	CRankingLogo2 *pRankingLogo2 = NULL;

	if (pRankingLogo2 == NULL)
	{
		// タイトルロゴクラスの生成
		pRankingLogo2 = new CRankingLogo2;

		if (pRankingLogo2 != NULL)
		{
			pRankingLogo2->SetPosition(pos);
			pRankingLogo2->SetWidth(fWidth);
			pRankingLogo2->SetHeight(fHeight);
			pRankingLogo2->Init();
			pRankingLogo2->BindTexture(CResource::GetTexture(nType));
		}
	}

	return pRankingLogo2;
}

//=============================================================================
// タイトルロゴクラスのコンストラクタ
//=============================================================================
CRankingLogo2::CRankingLogo2()
{
}

//=============================================================================
// タイトルロゴクラスのデストラクタ
//=============================================================================
CRankingLogo2::~CRankingLogo2()
{
}

//=============================================================================
// タイトルロゴ初期化処理
//=============================================================================
HRESULT CRankingLogo2::Init(void)
{
	// 2Dオブジェクト初期化処理
	CLogo::Init();


	CLogo::SetCol(BUTTON_COLOR);

	return S_OK;
}

//=============================================================================
// タイトルロゴ終了処理
//=============================================================================
void CRankingLogo2::Uninit(void)
{
	// 2Dオブジェクト終了処理
	CLogo::Uninit();
}

//=============================================================================
// タイトルロゴ更新処理
//=============================================================================
void CRankingLogo2::Update(void)
{
	//// 入力情報を取得
	//CInputKeyboard *pInputKeyboard;
	//pInputKeyboard = CManager::GetInputKeyboard();

	//// 入力情報を取得
	//CInputJoypad *pInputJoypad;
	//pInputJoypad = CManager::GetInputJoypad();

	//// フェードの状態を取得
	//CFade::FADE fade;
	//fade = CFade::GetFade();
}

//=============================================================================
// タイトルロゴ描画処理
//=============================================================================
void CRankingLogo2::Draw(void)
{
	// 2Dオブジェクト描画処理
	CLogo::Draw();
}